/* #FH  //z 2015-04-27 11:28:04 L.248'45116 BG57IV3@XCL T1418964723.K.F4146951713----+----+----+
+  0.FileInfo: +----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+
        File : E:\MyDoc\GitHub\ZNginx\Doc\K\T.2015.BugFree.cs.F4146951713--+----+----+----+----+
       Motto : No one can make you feel inferior without your consent.+----+----+----+----+----+
       Motto : The death of fear is in doing what you fear to do.+----+----+----+----+----+----+
       Motto : It's hard to beat a person who never gives up.----+----+----+----+----+----+----+
       Motto : Take what you do seriously. Not yourself.----+----+----+----+----+----+----+----+
       Motto : Life begins where your comfort zone ends.----+----+----+----+----+----+----+----+
       Motto : To know and not do, is not yet to know.-+----+----+----+----+----+----+----+----+
       Motto : The more you do , the more you can do.--+----+----+----+----+----+----+----+----+
       Motto : Do what you do best, better.--+----+----+----+----+----+----+----+----+----+----+
       Motto : Get Your Hands Dirty.----+----+----+----+----+----+----+----+----+----+----+----+
      Author : 126.org@gmail.com (R) Kaizen (->30,T5,M&M,W)-+----+----+----+----+----+----+----+

+  1.ID & Desc: ----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  2.Req & Repro: --+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  3.Folder & File: +----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  4.Cause & Solution: --+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  5.Todo & Done: --+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  6.Commit: --+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  7.Issue: ---+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  8.Summary: -+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

+  9.Misc: ----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+

***********************************************************************************************/

#region 04-27 11:28 R#.0    @Ver.Info
       Zey_S : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
		R#
        zcurr
        znote
        zp0
        zp1
        zp2
        zfav
        zsum
        zaddr
        zkz
        zpay
        zlog
        zdo
        ztime
        zmark
        zkaizen
        ztop
        zbottom
        zpause
        zfail
        zleaf
       Zey_E : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
       Zcl_S : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
       Zcl_E : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     Zndex_S : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     Zndex_E : //z 2015-05-26 16:59:29 L.219'25231 T553790787 .K ~272 +----+----+----+----+----+
     TimeCnt : //z 2015-05-22 17:23:06 L.223'23814 T1570279794.K ~10  +----+----+----+----+----+
     Reg.Cnt : //z 2015-05-22 17:22:59 L.223'23821 T1570244025.K ~15  +----+----+----+----+----+
     #15  R+ : //z 2015-05-22 17:22:59 L.223'23821 T1570244025.K ~15    V+.273  L+.295  
     #14  R+ : //z 2015-05-21 17:49:30 L.224'22230 T1505065974.K ~14    V+.196  L+.236  
     #13  R+ : //z 2015-05-19 16:07:36 L.226'28344 T2808715324.K ~13    V+.179  L+.227  
     #12  R+ : //z 2015-05-13 13:48:24 L.232'36696 T2827250037.K ~12    V+.174  L+.221  
     #11  R+ : //z 2015-05-13 12:38:32 L.232'40888 T1534596178.K ~11    V+.165  L+.210  
     #10  R+ : //z 2015-05-08 17:51:10 L.237'22130 T1800650386.K ~10    V+.142  L+.199  
     #9   R+ : //z 2015-05-08 10:28:46 L.237'48674 T1347003096.K ~9     V+.137  L+.192  
     #8   R+ : //z 2015-05-06 17:40:53 L.239'22747 T1663825909.K ~8     V+.127  L+.183  
     #7   R+ : //z 2015-04-30 15:28:39 L.245'30681 T4052705209.K ~7     V+.117  L+.176  
     #6   R+ : //z 2015-04-30 13:19:18 L.245'38442 T1468619220.K ~6     V+.109  L+.169  
     #5   R+ : //z 2015-04-28 16:26:55 L.247'27185 T3649066941.K ~5     V+.102  L+.162  
     #4   R+ : //z 2015-04-27 16:23:21 L.248'27399 T3581157650.K ~4     V+.46   L+.132  
     #3   R+ : //z 2015-04-27 11:35:34 L.248'44666 T1420042932.K ~3     V+.29   L+.108  
     #2   R+ : //z 2015-04-27 11:31:41 L.248'44899 T1419899214.K ~2     V+.19   L+.104  
     #1   R+ : //z 2015-04-27 11:28:08 L.248'45112 T1418964727.K ~1     V+.3    L+.62   
     File.Op : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     Version : //z 2015-05-26 16:59:29 L.219'25231 T553790787 .K ~287   R+.14   L+.294  --+----+
     #15  V+ : //z 2015-05-26 16:59:26 L.219'25234 T553790784 .K ~285   R+.14   L+.293  
     #14  R+ : //z 2015-05-22 17:22:59 L.223'23821 T1570244025.K ~273   R+.15   L+.296  V+.273  
     #14  V+ : //z 2015-05-21 18:07:22 L.224'21158 T2791718354.K ~266   R+.14   L+.280  
     #13  V+ : //z 2015-05-21 17:58:28 L.224'21692 T1506215933.K ~247   R+.14   L+.270  
     #12  V+ : //z 2015-05-21 17:54:48 L.224'21912 T1506072251.K ~228   R+.14   L+.255  
     #11  V+ : //z 2015-05-21 17:51:52 L.224'22088 T1505964467.K ~209   R+.14   L+.243  
     #10  R+ : //z 2015-05-21 17:49:30 L.224'22230 T1505065974.K ~196   R+.14   L+.237  V+.196  
     #10  V+ : //z 2015-05-20 17:38:06 L.225'22914 T1436042646.K ~190   R+.13   L+.229  
     #9   R+ : //z 2015-05-19 16:07:36 L.226'28344 T2808715324.K ~179   R+.13   L+.228  V+.179  
     #9   R+ : //z 2015-05-13 13:48:24 L.232'36696 T2827250037.K ~174   R+.12   L+.222  V+.174  
     #9   V+ : //z 2015-05-13 12:39:24 L.232'40836 T1534632084.K ~171   R+.11   L+.212  
     #8   R+ : //z 2015-05-13 12:38:32 L.232'40888 T1534596178.K ~165   R+.11   L+.211  V+.165  
     #8   V+ : //z 2015-05-08 17:52:13 L.237'22067 T1800686326.K ~152   R+.10   L+.198  
     #7   R+ : //z 2015-05-08 17:51:10 L.237'22130 T1800650386.K ~142   R+.10   L+.200  V+.142  
     #7   R+ : //z 2015-05-08 10:28:46 L.237'48674 T1347003096.K ~137   R+.9    L+.193  V+.137  
     #7   V+ : //z 2015-05-06 17:41:40 L.239'22700 T1663861810.K ~133   R+.8    L+.185  
     #6   R+ : //z 2015-05-06 17:40:53 L.239'22747 T1663825909.K ~127   R+.8    L+.184  V+.127  
     #6   R+ : //z 2015-04-30 15:28:39 L.245'30681 T4052705209.K ~117   R+.7    L+.177  V+.117  
     #6   V+ : //z 2015-04-30 15:28:34 L.245'30686 T4052705204.K ~114   R+.6    L+.172  
     #5   R+ : //z 2015-04-30 13:19:18 L.245'38442 T1468619220.K ~109   R+.6    L+.170  V+.109  
     #5   R+ : //z 2015-04-28 16:26:55 L.247'27185 T3649066941.K ~102   R+.5    L+.163  V+.102  
     #5   V+ : //z 2015-04-27 17:54:13 L.248'21947 T581251992 .K ~95    R+.4    L+.156  
     #4   V+ : //z 2015-04-27 16:35:40 L.248'26660 T3582415510.K ~76    R+.4    L+.139  
     #3   V+ : //z 2015-04-27 16:25:20 L.248'27280 T3581229523.K ~57    R+.4    L+.136  
     #2   R+ : //z 2015-04-27 16:23:21 L.248'27399 T3581157650.K ~46    R+.4    L+.133  V+.46   
     #2   V+ : //z 2015-04-27 13:22:56 L.248'38224 T4001685206.K ~38    R+.2    L+.95   
     #1   R+ : //z 2015-04-27 11:35:34 L.248'44666 T1420042932.K ~29    R+.3    L+.109  V+.29   
     #1   R+ : //z 2015-04-27 11:31:41 L.248'44899 T1419899214.K ~19    R+.2    L+.105  V+.19   
     #0   R+ : //z 2015-04-27 11:28:08 L.248'45112 T1418964727.K ~3     R+.1    L+.63   V+.3    
     K   Ter : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     K  Mers : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     K Kersi : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     KVersio : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     K Versi : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     K  Vers : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
     K   Ver : //z 2015-05-21 18:07:13 L.224'21167 T2791718322.K ~263   R+.14   L+.280  
     K    Ve : //z 2015-05-08 17:52:01 L.237'22079 T1800686291.K ~149   R+.10   L+.198  
     K     V : //z 2015-04-27 16:35:09 L.248'26691 T3582415387.K ~73    R+.4    L+.148  
     KaizenZ : //z 2015-04-27 11:28:04 L.248'45116 T1418964723.K ~0   +----+----+----+----+----+
#endregion //z 2015-04-27 11:28:04 L.248'45116 BG57IV3@XCL T1418964723.K.F4146951713-+----+----+

#region 04-27 11:28 R#.1    @日知录
//z 2015-04-27 11:29:17 L.248'45043 T1419000696.K[T1,L81,R1,V10]
01. Day.K.

//z 2015-04-27 11:29:48 L.248'45012 T1419000796.K[T2,L84,R1,V13]
02. 相较手写本，电子版本方便PC记录，同步等。
#endregion //z 2015-04-27 11:28:08 L.248'45112 BG57IV3@XCL T1418964727.K.F4146951713-+----+----+

#region 04-27 11:31 R#.2    @第17周总结 2015-04-26 --> 2015-05-02
Week.Plan
	01. 
Week.Done
	01. 2015-04-27 11:36 zdo focus windows system programming 以及工程实践。
    02. 2015-04-27 13:22 git update.bat
Week.Kaizen
	01. 2015-04-27 11:33 zkaizen 纯粹的肥肉还是别吃了；肉食类不要吃冷的。饭店吃饭尽量点热的。

日，R.2015-04-26 
一，W.2015-04-27 
二，W.2015-04-28 
三，W.2015-04-29 
四，W.2015-04-30 
五，W.2015-05-01 
六，R.2015-05-02 
#endregion //z 2015-04-27 11:31:41 L.248'44899 BG57IV3@XCL T1419899214.K.F4146951713-+----+----+

#region 04-27 11:35 R#.3    @国务院办公厅关于2015年部分节假日安排的通知
01. 国务院办公厅关于2015年部分节假日安排的通知
国务院办公厅关于2015年部分节假日安排的通知
国办发明电〔2014〕28号

各省、自治区、直辖市人民政府，国务院各部委、各直属机构：
　　经国务院批准，现将2015年元旦、春节、清明节、劳动节、端午节、中秋节和国庆节放假调休日期的具体安排通知如下。
　　一、元旦：1月1日至3日放假调休，共3天。1月4日（星期日）上班。
　　二、春节：2月18日至24日放假调休，共7天。2月15日（星期日）、2月28日（星期六）上班。
　　三、清明节：4月5日放假，4月6日（星期一）补休。
　　四、劳动节：5月1日放假，与周末连休。
　　五、端午节：6月20日放假，6月22日（星期一）补休。
　　六、中秋节：9月27日放假。
　　七、国庆节：10月1日至7日放假调休，共7天。10月10日（星期六）上班。
　　节假日期间，各地区、各部门要妥善安排好值班和安全、保卫等工作，遇有重大突发事件，要按规定及时报告并妥善处置，确保人民群众祥和平安度过节日假期。

　　　　　　　　　　　　　　　　　　　　　　　　 　　　　国务院办公厅
　　　　　　　　　　　　　　　　　　　　　　　　　　　　2014年12月16日
#endregion //z 2015-04-27 11:35:34 L.248'44666 BG57IV3@XCL T1420042932.K.F4146951713-+----+----+

#region 04-27 16:23 R#.4    @流程图 软件推荐
01. 还是选用 visio
Windows下VISIO最佳，MacOS下OmniGraffle最佳，其他软件也能画，但没这两个做得专业。OmniGraffle在操作上比VISIO更方便一些。
ProcessOn.com
OmniGraffle
draw.io
smartdraw
亿图
Enterprise Architect，我的最爱。做软件设计用的，也可以用来画流程图。
如果不是要非常专业的，我感觉Edraw Mind Map就够用了，主要它轻量，安装包才十几兆

OmniGraffle 教程
http://dingyu.me/blog/flowchart-howtos

Office 环境下还是用 Visio 画吧。
作为 LaTeX 党，我都是用 TikZ 画的。

METAPOST 例子
http://tex.loria.fr/prod-graph/zoonekynd/metapost/metapost.html

//z 2015-04-27 16:48:05 L.248'25915 T3583709115.K[T3,L153,R4,V80]
02. 了解下 visio 
2015-04-27 17:37 todo 阅读《我用VISIO制图》done 2015-04-28 16:26 当晚未看。
#endregion //z 2015-04-27 16:23:21 L.248'27399 BG57IV3@XCL T3581157650.K.F4146951713-+----+----+

#region 04-28 16:26 R#.5    @绘制类图，类继承
//z 2015-04-29 11:40:16 L.246'44384 T1556651858.K[T4,L162,R5,V107]
01. 总体上已完成。
#endregion //z 2015-04-28 16:26:55 L.247'27185 BG57IV3@XCL T3649066941.K.F4146951713-+----+----+

#region 04-30 13:19 R#.6    @EA公司发表自制的EASTL规格 游戏开发方面对STL的性能及功能需求的特点
01. 
#endregion //z 2015-04-30 13:19:18 L.245'38442 BG57IV3@XCL T1468619220.K.F4146951713-+----+----+

#region 04-30 15:28 R#.7    @参考下 cp 上的 tl 功能，看能否增强n.tl
//z 2015-04-30 15:29:27 L.245'30633 T4052741111.K[T5,L176,R7,V122]
01. 了解下。
#endregion //z 2015-04-30 15:28:39 L.245'30681 BG57IV3@XCL T4052705209.K.F4146951713-+----+----+

#region 05-06 17:40 R#.8    @收集方方面面的模式和实例。
//z 2015-05-06 17:41:07 L.239'22733 T1663861685.K[T6,L183,R8,V130]
01. 这样利用起来最快。
02. 但这也只是学习模式的一种。必然也有其局限性。
#endregion //z 2015-05-06 17:40:53 L.239'22747 BG57IV3@XCL T1663825909.K.F4146951713-+----+----+

#region 05-08 10:28 R#.9    @收集一份vc6的常用插件
//z 2015-05-08 10:29:10 L.237'48650 T1347038928.K[T7,L192,R9,V140]
01. 
#endregion //z 2015-05-08 10:28:46 L.237'48674 BG57IV3@XCL T1347003096.K.F4146951713-+----+----+

#region 05-08 17:51 R#.10   @zdo 使用 libcurl 写个http post[简繁转化]的例子
//z 2015-05-08 17:53:03 L.237'22017 T1800722230.K[T8,L200,R10,V159]
01. 算是略微了解下 curl 。
#endregion //z 2015-05-08 17:51:10 L.237'22130 BG57IV3@XCL T1800650386.K.F4146951713-+----+----+

#region 05-13 12:38 R#.11   @关灯吃面
//z 2015-05-13 12:38:40 L.232'40880 T1534596209.K[T9,L210,R11,V168]
01. 关灯吃面
2011年12月7日，重庆啤酒黑天鹅事件爆发。当天晚间，重庆啤酒一纸公告，宣布公司投巨资参与研制十三年的乙肝疫苗，经临床实验评估为无显著疗效。重庆啤酒股价应声暴跌，自次日起一连拉出9个一字跌停，股价从80元一路跌落至20元，市值蒸发超过200亿元，投资者出逃无门。

就在重庆啤酒第六个跌停的晚上，一位股民在东方财富网股吧中发表了一篇题为《一边吃，一边哭》的帖子：“今天回到家，煮了点面吃，一边吃面一边哭，泪水滴落在碗里，没有开灯”。帖子迅速在股民、网友中引起共鸣，“关灯吃面”一词从此被广泛引用，并逐渐成为表达股民群体内心痛苦的特定方式。
#endregion //z 2015-05-13 12:38:32 L.232'40888 BG57IV3@XCL T1534596178.K.F4146951713-+----+----+

#region 05-13 13:48 R#.12   @znote astyle -A1 -R -z1 -n *.cpp
01. astyle 命令行。
#endregion //z 2015-05-13 13:48:24 L.232'36696 BG57IV3@XCL T2827250037.K.F4146951713-+----+----+

#region 05-19 16:07 R#.13   @zlog hosts
01. 
git clone https://github.com/racaljk/hosts.git hosts_racaljk
2015-05-20 17:38 zkz Moving from Research to Practice to Close the Achievement Gap
#endregion //z 2015-05-19 16:07:36 L.226'28344 BG57IV3@XCL T2808715324.K.F4146951713-+----+----+

#region 05-21 17:49 R#.14   @3ds max
01. 
lib 3ds
64.233.188.102	lib3ds.googlecode.com
Modified version of lib3ds reader of .3ds format
http://www.codeproject.com/Articles/406882/Modified-version-of-lib-ds-reader-of-ds-format

http://www.arts.rpi.edu/public_html/ruiz/StuntDummiesFASTSourceCode/3ds.cpp
http://www.cs.virginia.edu/~jcc5t/classes/grad/animation/physical_simulator/3ds.cpp
https://github.com/gametutorials/tutorials
http://src.gnu-darwin.org/ports/games/alephone/work/AlephOne-20070525/Source_Files/ModelView/ModelRenderer.cpp
marathon /tags/SDL_release_0_12_0/Source_Files/ModelView/StudioLoader.cpp
https://searchcode.com/codesearch/view/11271988/
google 3ds loader Terry Caton

3DS File Loader
Submitted by Terry Caton
http://www.flipcode.com/archives/3DS_File_Loader.shtml

一个人在论坛求教的问题
http://www.gamedev.net/topic/91504-pointer-problem-i-think/

digiben@gametutorials.com 
https://cent.felk.cvut.cz/courses/PGR2/data/vavra1/html/3ds_8cpp-source.html

google tutorial ProcessNextKeyFrameChunk

Zero1_IZ3D is an (extremely old and outdated) 3D game engine attempt using C++/OpenGL
https://github.com/petarov/zero1iz3d

有一些古老游戏的demo。
Savage Wheels is a 2D car crashing arcade game, where up to 4 vehicles take part in a deadly tournament.
https://github.com/petarov
https://code.google.com/p/savagewheels/
http://www.kenamick.com/

physical_simulator
http://www.cs.virginia.edu/~jcc5t/classes/grad/animation/physical_simulator/

一些空间演示demo
http://www.spacesimulator.net/tutorials/index.html

3ds max文件中的模型顶点
http://miwenshu.lofter.com/post/96731_68ef653

3D-Studio File Format (.3ds)
http://www.martinreddy.net/gfx/3d/3DS.spec

http://www.the-labs.com/Blender/3DS-details.html

http://www.spacesimulator.net/tutorials/3ds_loader_tutorial.html

2015-05-26 16:59 zitem haptix googlecode
#endregion //z 2015-05-21 17:49:30 L.224'22230 BG57IV3@XCL T1505065974.K.F4146951713-+----+----+

#region 05-22 17:22 R#.15   @CMakeFile
//z 2015-05-22 17:23:06 L.223'23814 T1570279794.K[T10,L295,R15,V276]
01. 
cmake 生成vc 项目文件
新建vc win32工程，有源码文件program1.cpp, stdafx.cpp
新建CMakeLists.txt，写入
cmake_minimum_required(VERSION 2.8)

PROJECT(program1)

IF(WIN32)
    ADD_DEFINITIONS("-D_WINDOWS -D__WIN__ -D_CRT_SECURE_NO_DEPRECATE")
    ADD_DEFINITIONS("-D_WIN32_WINNT=0x0501")
ENDIF(WIN32)

SET (PLATFORM X86)

add_executable(program2 program1.cpp stdafx.cpp)

在vc 的开发使用的命令提示符下运行cmake-gui.exe，设置项目所在目录和生成的项目文件所在目录，点configure后，出现各种项目的选择，这里选择 visual studio 10, use default native compilers
然后点finish，配置完成，再点generate，生成sln,vcxproj等项目文件
________________________________________________________________________________________________
用cmake生成vs解决方案时，如果项目比较多，比如引用了很多开源库之类的，如果对项目进行分类，那源文件组织结构将清晰很多

在CMakeLists.txt的

cmake_minimum_required(VERSION 2.6)

前面加上这么一句

set_property(GLOBAL PROPERTY USE_FOLDERS On)

 

然后就可以在目标之后，即

add_library,add_executable

加入一句

set_target_properties(${prj_target} PROPERTIES FOLDER "test") 
#endregion //z 2015-05-22 17:22:59 L.223'23821 BG57IV3@XCL T1570244025.K.F4146951713-+----+----+
