#include "stdafx.h"

#include <string.h>
#include "era.h"
//年号
char* chineseEra(int y,char* strin)
{
    if(!strin)
    {
        return 0;
    }

    char nh[162][256]=
    {
        "0579[北周]静帝(宇文阐) 大象",
        "0581[北周]静帝(宇文阐) 大定",
        "0581[隋]文帝(杨坚)　开皇",
        "0605[隋]炀帝(杨广)　大业",
        "0617[隋]恭帝(杨侑)　义宁",
        "0618[唐]高祖(李渊)　武得",
        "0627[唐]太宗(李世民)　贞观",
        "0650[唐]高宗(李治)　永徽",
        "0656[唐]高宗(李治)　显庆",
        "0661[唐]高宗(李治)　龙朔",
        "0664[唐]高宗(李治)　麟德",
        "0666[唐]高宗(李治)　乾封",
        "0668[唐]高宗(李治)　总章",
        "0670[唐]高宗(李治)　咸亨",
        "0674[唐]高宗(李治)　上元",
        "0676[唐]高宗(李治)　仪凤",
        "0679[唐]高宗(李治)　调露",
        "0680[唐]高宗(李治)　永隆",
        "0681[唐]高宗(李治)　开耀",
        "0682[唐]高宗(李治)　永淳",
        "0683[唐]高宗(李治)　弘道",
        "0684[唐]中宗(李显又名哲)　嗣圣、睿宗(李旦)　文明",
        "0684[唐]武后(武曌)　光宅",
        "0684[唐]武后(武曌)　光宅",
        "0685[唐]武后(武曌)　垂拱",
        "0690[武周]武则天　载初、天授",
        "0692[武周]武则天　如意、长寿",
        "0694[武周]武则天　延载",
        "0695[武周]武则天　证圣、天册万岁",
        "0696[武周]武则天　万岁登封、万岁通天",
        "0697[武周]武则天　神功",
        "0698[武周]武则天　圣历",
        "0700[武周]武则天　久视",
        "0701[武周]武则天　长安",
        "0705[唐]中宗(李显又名哲)复唐国号　神龙",
        "0707[唐]中宗(李显又名哲)复唐国号　景龙",
        "0710[唐]睿宗(李旦)　景云",
        "0712[唐]睿宗(李旦)　延和、玄宗(~隆基)　先天",
        "0713[唐]玄宗(李隆基)　开元",
        "0742[唐]玄宗(李隆基)　天宝",
        "0756[唐]肃宗(李亨)　至德",
        "0758[唐]肃宗(李亨)　乾元",
        "0760[唐]肃宗(李亨)　上元",
        "0762[唐]代宗(李豫)　宝应",
        "0763[唐]代宗(李豫)　广德",
        "0765[唐]代宗(李豫)　永泰",
        "0766[唐]代宗(李豫)　大历",
        "0780[唐]德宗(李适)　建中",
        "0784[唐]德宗(李适)　兴元",
        "0785[唐]德宗(李适)　贞元",
        "0805[唐]顺宗(李诵)　永贞",
        "0806[唐]宪宗(李纯)　元和",
        "0821[唐]穆宗(李恒)　长庆",
        "0825[唐]敬宗(李湛)　宝历",
        "0826[唐]文宗(李昂)　宝历",
        "0827[唐]文宗(李昂)　大(太)和",
        "0841[唐]武宗(李炎)　会昌",
        "0847[唐]宣宗(李忱)　大中",
        "0859[唐]懿宗(李漼)　大中",
        "0860[唐]懿宗(李漼)　咸通",
        "0873[唐]僖宗(李儇)　咸通",
        "0874[唐]僖宗(李儇)　乾符",
        "0873[唐]僖宗(李儇)　广明",
        "0881[唐]僖宗(李儇)　中和",
        "0885[唐]僖宗(李儇)　光启",
        "0888[唐]僖宗(李儇)　文德",
        "0889[唐]昭宗(李晔)　龙纪",
        "0890[唐]昭宗(李晔)　大顺",
        "0892[唐]昭宗(李晔)　景福",
        "0894[唐]昭宗(李晔)　乾宁",
        "0898[唐]昭宗(李晔)　光化",
        "0901[唐]昭宗(李晔)　天复",
        "0904[唐]哀帝(李柷)　天祐",
        "0907[辽]太祖(耶律阿保机)",
        "0927[辽]太宗(耶律德光)　天显",
        "0938[辽]太宗(耶律德光)　会同",
        "0947[辽]世宗(耶律阮)　天禄",
        "0951[辽]穆宗(耶律璟)　应历",
        "0969[辽]景宗(耶律贤)　保宁",
        "0979[辽]景宗(耶律贤)　乾亨",
        "0982[辽]圣宗(耶律隆绪)　乾亨",
        "0983[辽]圣宗(耶律隆绪)　统和",
        "1012[辽]圣宗(耶律隆绪)　开泰",
        "1021[辽]圣宗(耶律隆绪)　太平",
        "1031[辽]兴宗(耶律宗真)　景福",
        "1032[辽]兴宗(耶律宗真)　重熙",
        "1055[辽]道宗(耶律洪基)　清宁",
        "1065[辽]道宗(耶律洪基)　咸雍",
        "1075[辽]道宗(耶律洪基)　大(太)康",
        "1085[辽]道宗(耶律洪基)　大安",
        "1095[辽]道宗(耶律洪基)　寿昌(隆)",
        "1101[辽]天祚帝(耶律延禧)　乾统",
        "1115[金]太祖(完颜旻，本名阿骨打)　收国",
        "1117[金]太祖(完颜旻，本名阿骨打)　天辅",
        "1123[金]太宗(完颜晟)　天会",
        "1135[金]熙宗(完颜亶)　天会",
        "1138[金]熙宗(完颜亶)　天眷",
        "1141[金]熙宗(完颜亶)　皇统",
        "1149[金]海陵王(完颜亮)　天德",
        "1153[金]海陵王(完颜亮)　贞元",
        "1156[金]海陵王(完颜亮)　正隆",
        "1161[金]世宗(完颜雍)　大定",
        "1190[金]章宗(完颜璟)　明昌",
        "1196[金]章宗(完颜璟)　承安",
        "1201[金]章宗(完颜璟)　泰和",
        "1206[元]太祖(孛儿只斤铁木真)(成吉思汗)",
        "1228[元]拖雷(监国)",
        "1229[元]太宗(孛儿只斤铁木真窝阔台)",
        "1242[元]乃马真后(称制)",
        "1246[元]定宗(孛儿只斤铁木真贵由)",
        "1249[元]海迷失后(称制)",
        "1249[元]海迷失后(称制)",
        "1249[元]海迷失后(称制)",
        "1249[元]海迷失后(称制)",
        "1249[元]海迷失后(称制)",
        "1249[元]海迷失后(称制)",
        "1251[元]宪宗(孛儿只斤铁木真蒙哥)",
        "1260[元]世祖(孛儿只斤铁木真忽必烈)　中统",
        "1264[元]世祖(孛儿只斤铁木真忽必烈)　至元",
        "1295[元]成宗(孛儿只斤铁木真铁穆耳)　元贞",
        "1297[元]成宗(孛儿只斤铁木真铁穆耳)　大德",
        "1308[元]武宗(孛儿只斤铁木真海山)　至大",
        "1312[元]仁宗(孛儿只斤铁木真爱育黎拔力八达)　皇庆",
        "1314[元]仁宗(孛儿只斤铁木真爱育黎拔力八达)　延祐",
        "1321[元]英宗(孛儿只斤铁木真硕德八剌)　至治",
        "1324[元]泰定帝(孛儿只斤铁木真也孙铁木儿)　泰定",
        "1328[元]泰定帝(孛儿只斤铁木真也孙铁木儿)　致和、天顺帝(阿速吉八)　天顺、文宗(~图帖睦尔)　天历",
        "1329[元]明宗(孛儿只斤铁木真和世“左‘王’右‘束’”)",
        "1330[元]明宗(孛儿只斤铁木真和世“左‘王’右‘束’”)　至顺",
        "1332[元]宁宗(孛儿只斤铁木真懿璘质班)　至顺",
        "1333[元]顺帝(孛儿只斤铁木真妥懽帖睦尔)　元统",
        "1335[元]顺帝(孛儿只斤铁木真妥懽帖睦尔)　至元",
        "1341[元]顺帝(孛儿只斤铁木真妥懽帖睦尔)　至正",
        "1368[明]太祖(朱元璋)　洪武",
        "1399[明]惠帝(朱允炆)　建文",
        "1403[明]成祖(朱棣)　永乐",
        "1425[明]仁宗(朱高炽)　洪熙",
        "1426[明]宣宗(朱瞻基)　宣德",
        "1436[明]英宗(朱祁镇)　正统",
        "1450[明]代宗(朱祁钰)(景帝)　景泰",
        "1457[明]英宗(朱祁镇)　天顺",
        "1465[明]宪宗(朱见深)　成化",
        "1488[明]孝宗(朱祐樘)　弘治",
        "1506[明]武宗(朱厚照)　正德",
        "1522[明]世宗(朱厚熜)　嘉靖",
        "1567[明]穆宗(朱载垕)隆庆",
        "1573[明]神宗(朱翊钧)　万历",
        "1616[清]太祖(爱新觉罗努尔哈赤)　天命",
        "1627[清]太宗(爱新觉罗皇太极)　天聪",
        "1636[清]太宗(爱新觉罗皇太极)　崇德",
        "1644[清]世祖(爱新觉罗福临)　顺治",
        "1662[清]圣祖(爱新觉罗玄烨)　康熙",
        "1723[清]世宗(爱新觉罗胤禛)　雍正",
        "1736[清]高宗(爱新觉罗弘历)　乾隆",
        "1796[清]仁宗(爱新觉罗颙琰)　嘉庆",
        "1821[清]宣宗(爱新觉罗旻宁)　道光",
        "1851[清]文宗(爱新觉罗奕詝)　咸丰",
        "1862[清]穆宗(爱新觉罗载淳)　同治",
        "1875[清]德宗(爱新觉罗载湉)　光绪",
        "1909[清]爱新觉罗溥仪　宣统",
        "1912中华民国",
        "1949中华人民共和国建国第"
    };

    char alt[71][256]=
    {
        //用于记载旧朝代末的年号，数字后无汉字的表示该朝当年灭亡
        "0907(五代)[后梁]太祖(朱晃,又名温、全忠)　开平",
        "0911(五代)[后梁]太祖(朱晃,又名温、全忠)　乾化",
        "0913(五代)[后梁]末帝(朱瑱)　乾化",
        "0915(五代)[后梁]末帝(朱瑱)　贞明",
        "0921(五代)[后梁]末帝(朱瑱)　龙德",
        "923",
        "0923(五代)[后唐]庄宗(李存勖)　同光",
        "0926(五代)[后唐]明宗(~亶)　天成",
        "0930(五代)[后唐]明宗(~亶)　天成",
        "0934(五代)[后唐]末帝(~从珂)　清泰",
        "0936",
        "0936(五代)[后晋]高祖(石敬瑭)　天福",
        "0942(五代)[后晋]高祖(石敬瑭)　出帝",
        "0944[后晋]高祖(石敬瑭)　开运",
        "0947",
        "0947(五代)[后汉]高祖(刘暠,本名知远)　天福",
        "0948(五代)[后汉]隐帝(刘承祐)　乾祐",
        "0950",
        "0951(五代)[后周]太祖(郭威)　广顺",
        "0954(五代)[后周]世宗(柴荣)　显德",
        "0959(五代)[后周]恭帝(宗训)　显德",
        "0960",
        "0960[北宋]太祖(赵匡胤)　建隆",
        "0963[北宋]太祖(赵匡胤)　乾德",
        "0968[北宋]太祖(赵匡胤)　开宝",
        "0976[北宋]太宗(赵炅,本名匡义,又名光义)　太平兴国",
        "0984[北宋]太宗(赵炅,本名匡义,又名光义)　雍熙",
        "0988[北宋]太宗(赵炅,本名匡义,又名光义)　端拱",
        "0990[北宋]太宗(赵炅,本名匡义,又名光义)　淳化",
        "0995[北宋]太宗(赵炅,本名匡义,又名光义)　至道",
        "0998[北宋]真宗(赵恒)　咸平",
        "1004[北宋]真宗(赵恒)　景德",
        "1008[北宋]真宗(赵恒)　大中祥符",
        "1017[北宋]真宗(赵恒)　天禧",
        "1022[北宋]真宗(赵恒)　乾兴",
        "1023[北宋]仁宗(赵祯)　天圣",
        "1032[北宋]仁宗(赵祯)　明道",
        "1034[北宋]仁宗(赵祯)　景祐",
        "1038[北宋]仁宗(赵祯)　宝元",
        "1040[北宋]仁宗(赵祯)　康定",
        "1041[北宋]仁宗(赵祯)　庆历",
        "1049[北宋]仁宗(赵祯)　皇祐",
        "1054[北宋]仁宗(赵祯)　至和",
        "1056[北宋]仁宗(赵祯)　嘉祐",
        "1064[北宋]英宗(赵曙)　治平",
        "1068[北宋]神宗(赵顼)　熙宁",
        "1078[北宋]神宗(赵顼)　元丰",
        "1086[北宋]哲宗(赵煦)　元祐",
        "1094[北宋]哲宗(赵煦)　绍圣",
        "1098[北宋]哲宗(赵煦)　元符",
        "1101[北宋]徽宗(赵佶)　建中靖国",
        "1102[北宋]徽宗(赵佶)　崇宁",
        "1107[北宋]徽宗(赵佶)　大观",
        "1111[北宋]徽宗(赵佶)　政和",
        "1118[北宋]徽宗(赵佶)　重和",
        "1119[北宋]徽宗(赵佶)　宣和",
        "1126[北宋]钦宗(赵桓)　靖康",
        "1127",
        "1209[金]卫绍王(完颜永济)　大安",
        "1212[金]卫绍王(完颜永济)　崇庆",
        "1213[金]宣宗(~珣)　贞祐",
        "1217[金]宣宗(完颜珣)　兴定",
        "1222[金]宣宗(完颜珣)　元光",
        "1224[金]哀宗(完颜守绪)　正大",
        "1224[金]哀宗(完颜守绪)　正大",
        "1232[金]天兴",
        "1234",
        "1620[明]光宗(朱常洛)　泰昌",
        "1621[明]熹宗(朱由校)　天启",
        "1628[明]思宗(朱由检)　崇祯",
        "1644"
    };

    char alt2[26][256]=
    {
        //用于记载旧朝代末的年号，数字后无汉字的表示该朝当年灭亡
        "1111[辽]天祚帝(耶律延禧)　天庆",
        "1121[辽]天祚帝(耶律延禧)　保大",
        "1125",
        "1127[南宋]高宗(赵构)　建炎",
        "1131[南宋]高宗(赵构)　绍兴",
        "1165[南宋]孝宗(赵昚)　隆兴",
        "1174[南宋]孝宗(赵昚)　乾道",
        "1183[南宋]孝宗(赵昚)　淳熙",
        "1190[南宋]光宗(赵惇)　绍熙",
        "1195[南宋]宁宗(赵扩)　庆元",
        "1201[南宋]宁宗(赵扩)　嘉泰",
        "1205[南宋]宁宗(赵扩)　开禧",
        "1208[南宋]宁宗(赵扩)　嘉定",
        "1225[南宋]理宗(赵昀)　宝庆",
        "1228[南宋]理宗(赵昀)　绍定",
        "1234[南宋]理宗(赵昀)　端平",
        "1237[南宋]理宗(赵昀)　嘉熙",
        "1241[南宋]理宗(赵昀)　淳祐",
        "1253[南宋]理宗(赵昀)　宝祐",
        "1259[南宋]理宗(赵昀)　开庆",
        "1260[南宋]理宗(赵昀)　景定",
        "1265[南宋]度宗(赵禥)　咸淳",
        "1275[南宋]恭帝(赵?繁体“显”去掉右边“页”)　德祐",
        "1276[南宋]端宗(赵昰)　景炎",
        "1278[南宋]帝昺(赵昺)　祥兴",
        "1279"
    };

    char str[128],str1[128],str3[128]; //年号
    /*
    int i = 0;
    for(i = 0;i < 162;i++)
    {
    int y0 = 0;
    sscanf(nh[i],"%d",&y0);
    int n=y-y0+1;
    if(n>0)
    {
    str=nh[i].substring(4,100)+n+'年';
    }
    if(y>=1111&&y<1115)
    str='';
    }
    for(i in alt){
    var y0=parseFloat(alt[i].substring(0,4));
    var n=y-y0+1;
    if(n>0){
    var str2=alt[i].substring(4,100);
    if(str2!='')
    str1=str2+n+'年';
    else
    str1='';
    }
    }
    for(i in alt2){
    var y0=parseFloat(alt2[i].substring(0,4));
    var n=y-y0+1;
    if(n>0){
    var str4=alt2[i].substring(4,100);
    if(str4!='')
    str3=str4+n+'年';
    else
    str3='';
    }
    }*/
//return str+'　'+str1+'　'+str3;
    strcpy(strin,"没有年号");
    return strin;
}

//alert(chineseEra(1506));
